case/constant/transportProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water air);

water
{
    transportModel  Newtonian;
    nu              9.79e-06;
    rho             827;
}

air
{
    transportModel  Newtonian;
    nu              1.48e-05;
    rho             1.225;
}

sigma           0.027;

surfaceForces
{
    // RDF constantCurvature fitParaboloid gradAlpha heightFunction
    surfaceTensionForceModel RDF;

    //surfaceTensionForceModel gradAlpha;
    sigma   0.027;

    accelerationForceModel gravity;
}



// ************************************************************************* //
